{
  "filename": "test pdf .pdf",
  "extractedAt": "2025-09-29T01:44:21.873Z",
  "totalItems": 20,
  "items": [
    {
      "id": 1,
      "text": "Just tried Trendorabbb for the first time and wow  The customer support was next level."
    },
    {
      "id": 2,
      "text": "Trendora honestly makes shopping feel fun again. Whoever designed the app deserves a raise."
    },
    {
      "id": 3,
      "text": "Big shoutout to Trendora — delivery came two days early and everything was exactly as pictured"
    },
    {
      "id": 4,
      "text": "I don't usually hype brands, but Trendora might be the most underrated platform right now."
    },
    {
      "id": 5,
      "text": "My closet has officially become a Trendora showroom"
    },
    {
      "id": 6,
      "text": "Trendora has potential, but the checkout process is way too buggy. Fix it please."
    },
    {
      "id": 7,
      "text": "Anyone else feel like Trendora's prices are creeping up? Wasn't like this a few months ago."
    },
    {
      "id": 8,
      "text": "Tried Trendora again today... still not impressed. Slow app, and the recommendations don't match my style."
    },
    {
      "id": 9,
      "text": "Trendora's ads are EVERYWHERE. Chill."
    },
    {
      "id": 10,
      "text": "Low-key annoyed that Trendora canceled my order without explanation."
    },
    {
      "id": 11,
      "text": "Trendora just dropped a new collection. Curious to see how people react."
    },
    {
      "id": 12,
      "text": "Scrolling through Trendora is basically my new morning routine now."
    },
    {
      "id": 13,
      "text": "Got an email from Trendora about a \"big update\" coming soon. Wonder what it is."
    },
    {
      "id": 14,
      "text": "Anyone know if Trendora ships internationally yet?"
    },
    {
      "id": 15,
      "text": "Trendora reminds me of early days of ASOS — still figuring out its vibe."
    },
    {
      "id": 16,
      "text": "Trendora has great designs but man, the delivery speed could use some love."
    },
    {
      "id": 17,
      "text": "Used Trendora last week — not perfect, but definitely better than the alternatives I've tried."
    },
    {
      "id": 18,
      "text": "I want to love Trendora so badly, but customer service keeps letting me down."
    },
    {
      "id": 19,
      "text": "Okay, Trendora's app UI =  but why does it log me out every time??"
    },
    {
      "id": 20,
      "text": "Trendora feels like that friend who's always late but still fun to hang out with."
    }
  ]
}